<script setup lang="ts">
const { t } = useI18n()

useHead({
	title: t('navigation.agreement')
})

const value = `
# Пользовательское соглашение

Настоящее Пользовательское соглашение (далее — **Соглашение**) регулирует отношения между пользователем (далее — **Пользователь**) и владельцем проекта **«Финансовый трекер»** (далее — **Проект**).

## 1. Общие положения

1. Используя Проект, Пользователь подтверждает, что ознакомился с условиями настоящего Соглашения и принимает их.
2. Проект предоставляется «как есть» (*as is*). Разработчик не несёт ответственности за любые сбои, ошибки или потерю данных, возникшие при использовании Проекта.
3. Проект создан исключительно в демонстрационных и учебных целях, не предназначен для коммерческого использования или хранения критически важных финансовых данных.

## 2. Хранение и безопасность данных

1. Данные Пользователя хранятся на стороннем сервисе **Supabase** в рамках бесплатного тарифа.
2. В соответствии с условиями Supabase, данные могут быть удалены в случае длительного отсутствия активности или при изменении политики сервиса.
3. Пользователь осознаёт и принимает риск потери данных и обязуется самостоятельно сохранять резервные копии при необходимости.
4. Разработчик не несёт ответственности за удаление, утерю или несанкционированный доступ к данным, произошедшие по причинам, не зависящим от него.

## 3. Ограничение ответственности

1. Разработчик не несёт ответственности за возможный ущерб, возникший в результате использования или невозможности использования Проекта.
2. Проект не предоставляет финансовых, юридических или инвестиционных консультаций.
3. Вся информация представлена исключительно в ознакомительных целях.

## 4. Изменения и обновления

1. Разработчик имеет право в любое время изменять, приостанавливать или прекращать работу Проекта без предварительного уведомления.
2. Продолжая использовать Проект после изменений, Пользователь соглашается с обновлёнными условиями.

## 5. Контакты

По вопросам, связанным с использованием Проекта, можно обратиться по адресу:
**[alex-bulanov.mail@yandex.ru]**
`
</script>

<template>
	<main class="my-6">
		<UContainer>
			<MDC :value="value" />
		</UContainer>
	</main>
</template>
